# SQL Introduction Exercise: TMDb Database
#### Â© Explore Data Science Academy

## Instructions

This challenge wass designed to determine how much that had been learned so far and to test the knowledge on basic SQL statements.

Questions were provided which were answered using basic SQL Queries in attempt to test my understanding of the subject matter.

## The TMDb Database

In this challenge I explored the [The Movie Database](https://www.themoviedb.org/) - an online movie and TV show database, which houses some of the most popular movies and TV shows at your finger tips. The TMDb database supports 39 official languages used in over 180 countries daily and dates all the way back to 2008. 


<img src="images/sql_tmdb.jpg" width=80%/>


Below is an Entity Relationship diagram(ERD) of the TMDb database:

<img src="images/TMDB_ER_diagram.png" width=70%/>

As can be seen from the ER diagram, the TMDb database consists of `12 tables` containing information about movies, cast, genre and so much more.  



#### Getting started!

## Loading the database

The SQL environment was prepared by loading in the magic command below in order to use SQL queries.

The database, TMDB.db, was then loaded into the SQL environment in the following cell.

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///data/TMDB.db

<br>
<br>

#### The query below was used to view all the tables in the database

In [3]:
%%sql

SELECT name FROM sqlite_master WHERE type IN ('table', 'view') AND name NOT LIKE 'sqlite_%' ORDER BY 1

 * sqlite:///data/TMDB.db
Done.

[('Alan_Rickman_Movies',),
 ('actors',),
 ('casts',),
 ('genremap',),
 ('genres',),
 ('keywordmap',),
 ('keywords',),
 ('languagemap',),
 ('languages',),
 ('movies',),
 ('oscars',),
 ('productioncompanies',),
 ('productioncompanymap',),
 ('productioncountries',),
 ('productioncountrymap',),
 ('sysdiagrams',)]

<br>
<br>

#### In the following cells, questions were provided that are to be answered from the database using SQL queries.

### Question

A SQL query to view the whole movies table.

In [4]:
%%sql


SELECT *
FROM Movies
LIMIT 2;

 * sqlite:///data/TMDB.db
Done.

[(5, 'Four Rooms', '1995-12-09 00:00:00.000000', 4000000, None, 'en', 'Four Rooms', "It's Ted the Bellhop's first night on the job...and the hotel's very unusual guests are about to place him in some outrageous predicaments. It seems that this evening's room service is serving up one unbelievable happening after another.", 22.87623, 4300000.0, 98.0, 'Released', "Twelve outrageous guests. Four scandalous requests. And one lone bellhop, in his first day on the job, who's in for the wildest New year's Eve of his life.", 6.5, 530),
 (11, 'Star Wars', '1977-05-25 00:00:00.000000', 11000000, 'http://www.starwars.com/films/star-wars-episode-iv-a-new-hope', 'en', 'Star Wars', 'Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker a ... (14 characters truncated) ... tain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.', 126.393695, 775398007.0, 121.0, 'Released', 'A long time ago in a galaxy far, far away...', 8.1, 6624)]

### Question

A drill down on the database to identify the budget for the movie **"Inception"**

In [5]:
%%sql

SELECT movies.budget
FROM movies
WHERE lower(movies.title) = "inception"

 * sqlite:///data/TMDB.db
Done.

[(160000000,)]

<br>

### Question
Runtime of the movie **"Titanic".**

In [6]:
%%sql

SELECT movies.title AS "Title", movies.runtime AS "Runtime (Minutes)"
FROM movies
WHERE lower(movies.title) = "titanic"

 * sqlite:///data/TMDB.db
Done.

[('Titanic', 194.0)]

<br>

### Question
Checking for the number of movies that do not have English as their original language? (âenâ being the abbreviation for English)

In [7]:
%%sql

SELECT count(movies.movie_id) AS "Number_of_movies"
FROM movies
WHERE movies.original_language != "en"

 * sqlite:///data/TMDB.db
Done.

[(298,)]

<br>

### Question

Checking for the number of movies that have a popularity score of more than 250.

In [8]:
%%sql

SELECT count(movies.movie_id) AS "Number_of_movies_with_popularity > 250"
FROM movies
WHERE movies.popularity > 250

 * sqlite:///data/TMDB.db
Done.

[(7,)]

<br>

### Question

Checking for the number of movies whose title is not the same as the original title.

In [9]:
%%sql

SELECT count(movies.title) AS "Number_of_movies"
FROM movies
WHERE movies.title != movies.original_title

 * sqlite:///data/TMDB.db
Done.

[(261,)]

<br>

### Question

Checking for the number of movies that managed to get a popularity rating of more than 100 with a budget of less than $10 000 000.

In [10]:
%%sql

SELECT count(movies.movie_id) AS "Number_of_movies_with_popularity_>_100_and_budget_<_$10M"
FROM movies
WHERE movies.popularity > 100
AND movies.budget < 10000000

 * sqlite:///data/TMDB.db
Done.

[(5,)]

<br>
<br>

### Question

Number of movies with the word "love" in their titles.

In [11]:
%%sql

SELECT count(movies.movie_id) AS "Number_of_movies"
FROM movies
WHERE lower(movies.title)
LIKE "%love%"

 * sqlite:///data/TMDB.db
Done.

[(71,)]

<br>
<br>

### Question

Checking for the number of movies that were released between the dates 1 August 2012 and 31 July 2013.

In [12]:
%%sql

SELECT count(movies.movie_id) AS "Number_of_movies"
FROM movies
WHERE movies.release_date BETWEEN "2012-08-01 00:00:00.000000" AND "2013-07-31 00:00:00.000000"

 * sqlite:///data/TMDB.db
Done.

[(227,)]

<br>
<br>

### Question
**Illustration**

You have had a long day and want to sit back and enjoy a movie. Unfortunately, today you are only in the mood for a very specific type of movie. It definitely needs to be in English. It should also be new, something after 1 Jan 2010, but not too new as you might have seen it recently, so it must have been released before 1 Jan 2016. It should also be a romantic movie, so make sure it has the word love somewhere in the title. You also want it to be a big blockbuster, so the budget of the movie must be more than $10 000 000.

Checking for the movie with the highest popularity that meets all the requirements above.

In [13]:
%%sql

SELECT movies.title AS "Movie_title", movies.popularity AS "Popularity"
FROM movies
WHERE movies.original_language = "en"
AND lower(movies.title) LIKE "%love%"
AND movies.budget > 10000000
AND movies.release_date BETWEEN "2010-01-01 00:00:00.000000" AND "2016-01-01 00:00:00.000000"
ORDER BY [Popularity] DESC

 * sqlite:///data/TMDB.db
Done.

[('Crazy, Stupid, Love.', 37.990705),
 ('Eat Pray Love', 28.800112),
 ('From Paris with Love', 27.916284),
 ('Endless Love', 27.256849),
 ('Love & Other Drugs', 20.236951),
 ('To Rome with Love', 15.013386),
 ('Love the Coopers', 9.191187),
 ('Accidental Love', 5.644844),
 ('The Lovers', 2.418535)]